1033087886/esp32-cam/src/main.cpp
const uint8_t flashLedPin = 4;

#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
const bool useNewLedcApi = true;
#else
const bool useNewLedcApi = false;
const uint8_t flashLedChannel = 7;
#endif

WiFiClient mqttPlainClient;
WiFiClientSecure mqttTlsClient;
PubSubClient mqttClient(mqttPlainClient);
WebsocketsClient wsClient(std::make_shared<EspTlsSecuredTcpClient>(streamWsCaCert));
bool wsConnected = false;
bool mqttUsingInsecure = false;

String topicCmdLight;
String topicStateLight;
String topicStateOnline;
String topicStateHeartbeat;
String topicAck;

uint8_t currentLight = 0;
unsigned long lastWifiRetryTime = 0;
unsigned long lastMqttConnectAttempt = 0;
unsigned long lastHeartbeatTime = 0;
unsigned long lastWsConnectAttempt = 0;
unsigned long lastFrameTime = 0;
unsigned long lastStreamStatTime = 0;
unsigned long lastWsPingTime = 0;
unsigned long wsConnectedAt = 0;
unsigned long wsReconnectCount = 0;
unsigned long streamFramesSent = 0;
unsigned long streamFramesDropped = 0;
unsigned long streamBytesSent = 0;
unsigned long wsBusyDropCount = 0;
uint8_t currentJpegQuality = 0;
bool wifiWasConnected = false;
bool hasIPv6 = false;
String currentIPv6;
String currentIPv6Type = "NONE";
unsigned long lastIPv6TryTime = 0;
uint8_t ipv6TryCount = 0;
bool ipv6RetryExhaustedLogged = false;

void setup() {
  Serial.begin(115200);
  delay(150);
  Serial.println("\n--- ESP32-CAM MQTT + WS 推流启动 ---");
  printMemoryInfo("启动后");
  if (strlen(STREAM_WS_TOKEN) == 0) {
    Serial.println("[WS] 警告: STREAM_WS_TOKEN 为空，若 Worker 开启鉴权将返回 401");
  }
  WiFi.onEvent(onWiFiEvent);

  setupTopics();
  setupFlashPwm();

  if (!initCamera()) {
    Serial.println("[BOOT] 摄像头初始化失败，5秒后重启");
    delay(5000);
    ESP.restart();
  }
  printMemoryInfo("摄像头初始化后");

  setupMqttTransport();
  mqttClient.setServer(mqttHost, mqttPort);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(512);
  mqttClient.setKeepAlive(60);
  mqttClient.setSocketTimeout(15);

  wsClient.onEvent([](WebsocketsEvent event, String data) {
    (void)data;
    if (event == WebsocketsEvent::ConnectionOpened) {
      wsConnected = true;
      wsConnectedAt = millis();
      lastWsPingTime = millis();
      lastStreamStatTime = millis();
      streamFramesSent = 0;
      streamFramesDropped = 0;
      streamBytesSent = 0;
      wsBusyDropCount = 0;
      Serial.println("[WS] 推流连接成功");
    } else if (event == WebsocketsEvent::ConnectionClosed) {
      wsConnected = false;
      unsigned long aliveMs = (wsConnectedAt > 0) ? (millis() - wsConnectedAt) : 0;
      Serial.printf("[WS] 推流连接断开，在线时长=%lu ms, RSSI=%d\n", aliveMs, WiFi.RSSI());
    }
  });
  wsClient.addHeader("Origin", "https://stream.rose980.eu.cc");
  wsClient.addHeader("User-Agent", "ESP32-CAM");

  connectWiFi();
  if (WiFi.status() == WL_CONNECTED) {
    wifiWasConnected = true;
    if (enablePortalAuth) {
      doPortalAuth();
      previousAuthTime = millis();
      delay(1000);
      testInternet();
    }
    syncTimeIfNeeded();
  }

  connectMQTT();
  connectStreamWs();
}

void loop() {
  unsigned long now = millis();

  if (WiFi.status() != WL_CONNECTED) {
    if (wifiWasConnected) {
      wifiWasConnected = false;
      Serial.println("[WiFi] 已断开，等待重连");
      wsConnected = false;
      if (wsClient.available()) wsClient.close();
    }

    if (now - lastWifiRetryTime >= wifiReconnectInterval) {
      lastWifiRetryTime = now;
      connectWiFi();
    }

    delay(10);
    return;
  }

  if (!wifiWasConnected) {
    wifiWasConnected = true;
    Serial.printf("[WiFi] 重连成功，IP=%s\n", WiFi.localIP().toString().c_str());
    if (enablePortalAuth) {
      doPortalAuth();
      previousAuthTime = now;
      testInternet();
    }
    syncTimeIfNeeded();
  }

  if (enablePortalAuth && now - previousAuthTime >= authInterval) {
    previousAuthTime = now;
    Serial.println("[Portal] 认证间隔到期，执行续期认证");
    doPortalAuth();
  }

  if (!mqttClient.connected() && now - lastMqttConnectAttempt >= mqttReconnectInterval) {
    lastMqttConnectAttempt = now;
    connectMQTT();
  }

  if (!hasIPv6 && ipv6TryCount < ipv6MaxRetry && now - lastIPv6TryTime >= ipv6RetryInterval) {
    requestIPv6("loop-retry");
  } else if (!hasIPv6 && ipv6TryCount >= ipv6MaxRetry && !ipv6RetryExhaustedLogged) {
    ipv6RetryExhaustedLogged = true;
    Serial.println("[WiFi] IPv6 多次申请仍未成功，当前热点可能未向 STA 分配 IPv6");
  }

  if (mqttClient.connected()) {
    mqttClient.loop();
    if (now - lastHeartbeatTime >= mqttHeartbeatInterval) {
      lastHeartbeatTime = now;
      publishHeartbeat();
    }
  }

  if (!wsClient.available() && now - lastWsConnectAttempt >= wsReconnectInterval) {
    lastWsConnectAttempt = now;
    connectStreamWs();
  }

  wsClient.poll();
  sendStreamFrameIfReady();

  if (wsClient.available() && now - lastWsPingTime >= wsPingInterval) {
    if (!wsClient.ping()) {
      Serial.println("[WS] ping 失败，主动重连");
      wsClient.close();
      wsConnected = false;
    }
    lastWsPingTime = now;
  }
}

void setupTopics() {
  String base = String("esp32cam/") + deviceId;
  topicCmdLight = base + "/cmd/light";
  topicStateLight = base + "/state/light";
  topicStateOnline = base + "/state/online";
  topicStateHeartbeat = base + "/state/heartbeat";
  topicAck = base + "/ack";
}

void setupFlashPwm() {
  pinMode(flashLedPin, OUTPUT);

  if (useNewLedcApi) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    if (!ledcAttach(flashLedPin, 5000, 8)) {
      Serial.println("[LED] ledcAttach 初始化失败");
    }
#endif
  } else {
#if !defined(ESP_ARDUINO_VERSION_MAJOR) || (ESP_ARDUINO_VERSION_MAJOR < 3)
    ledcSetup(flashLedChannel, 5000, 8);
    ledcAttachPin(flashLedPin, flashLedChannel);
#endif
  }

  setFlashBrightness(0, false);
}

void setFlashBrightness(uint8_t value, bool reportState) {
  currentLight = value;

  if (useNewLedcApi) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcWrite(flashLedPin, currentLight);
#endif
  } else {
#if !defined(ESP_ARDUINO_VERSION_MAJOR) || (ESP_ARDUINO_VERSION_MAJOR < 3)
    ledcWrite(flashLedChannel, currentLight);
#endif
  }

  Serial.printf("[LED] 当前亮度=%u\n", currentLight);

