1033087886/esp32-cam/src/main.cpp
  if (reportState) {
    publishLightState();
  }
}

void publishLightState() {
  if (!mqttClient.connected()) return;

  String payload = String("{\"light\":") + String(currentLight) + ",\"pin\":" + String(flashLedPin) + "}";
  if (mqttClient.publish(topicStateLight.c_str(), payload.c_str(), true)) {
    Serial.println("[MQTT] 亮度状态: " + payload);
  }
}

void publishHeartbeat() {
  if (!mqttClient.connected()) return;

  String payload = "{";
  payload += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  if (hasIPv6 && currentIPv6.length() > 0) {
    payload += "\"ipv6\":\"" + currentIPv6 + "\",";
    payload += "\"ipv6_type\":\"" + currentIPv6Type + "\",";
  }
  payload += "\"mac\":\"" + WiFi.macAddress() + "\",";
  payload += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  payload += "\"light\":" + String(currentLight);
  payload += "}";

  if (mqttClient.publish(topicStateHeartbeat.c_str(), payload.c_str(), false)) {
    Serial.println("[MQTT] 心跳: " + payload);
  }
}

void publishAck(const char* msg) {
  if (!mqttClient.connected()) return;
  mqttClient.publish(topicAck.c_str(), msg, false);
}

void setupMqttTransport() {
  if (!mqttUseTls) {
    mqttClient.setClient(mqttPlainClient);
    mqttUsingInsecure = true;
    Serial.println("[MQTT] 使用明文 TCP 模式（1883）");
    return;
  }

  mqttClient.setClient(mqttTlsClient);

  if (strstr(mqttCaCert, "PASTE_YOUR_CA_CERT_HERE") != nullptr) {
    mqttUsingInsecure = true;
    mqttTlsClient.setInsecure();
    Serial.println("[MQTT] TLS 未配置 CA，已启用 setInsecure");
  } else {
    mqttUsingInsecure = false;
    mqttTlsClient.setCACert(mqttCaCert);
    Serial.println("[MQTT] TLS 已加载 CA 证书");
  }
}

void syncTimeIfNeeded() {
  if (!mqttUseTls || mqttUsingInsecure) return;

  Serial.println("[NTP] 正在同步时间");
  configTime(0, 0, "ntp.aliyun.com", "pool.ntp.org", "time.google.com");

  time_t now = time(nullptr);
  int retry = 0;
  while (now < 1700000000 && retry < 20) {
    delay(500);
    Serial.print(".");
    now = time(nullptr);
    retry++;
  }

  if (now >= 1700000000) {
    Serial.printf("\n[NTP] 时间同步成功: %s", ctime(&now));
  } else {
    Serial.println("\n[NTP] 时间同步失败，TLS 校验可能失败");
  }
}

void onWiFiEvent(WiFiEvent_t event) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_CONNECTED: {
      requestIPv6("STA_CONNECTED");
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_GOT_IP: {
      requestIPv6("STA_GOT_IP");
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_GOT_IP6: {
      refreshIPv6Status(true);
      ipv6RetryExhaustedLogged = false;
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      hasIPv6 = false;
      currentIPv6 = "";
      currentIPv6Type = "NONE";
      lastIPv6TryTime = 0;
      ipv6TryCount = 0;
      ipv6RetryExhaustedLogged = false;
      break;

    default:
      break;
  }
}

void requestIPv6(const char* reason) {
  if (WiFi.status() != WL_CONNECTED) return;
  bool ok = WiFi.enableIpV6();
  lastIPv6TryTime = millis();
  if (ipv6TryCount < 255) {
    ipv6TryCount++;
  }
  Serial.printf("[WiFi] IPv6 申请(%s): %s, 次数=%u\n", reason, ok ? "已发送" : "失败", ipv6TryCount);
}

const char* classifyIPv6Type(const esp_ip6_addr_t& addr) {
  const ip6_addr_t* lwipAddr = reinterpret_cast<const ip6_addr_t*>(&addr);
  if (ip6_addr_isglobal(lwipAddr)) return "GLOBAL";
  if (ip6_addr_isuniquelocal(lwipAddr)) return "ULA";
  if (ip6_addr_islinklocal(lwipAddr)) return "LINK_LOCAL";
  if (ip6_addr_isloopback(lwipAddr)) return "LOOPBACK";
  return "OTHER";
}

int ipv6TypeScore(const char* type) {
  if (strcmp(type, "GLOBAL") == 0) return 4;
  if (strcmp(type, "ULA") == 0) return 3;
  if (strcmp(type, "LINK_LOCAL") == 0) return 2;
  if (strcmp(type, "OTHER") == 0) return 1;
  return 0;
}

void refreshIPv6Status(bool verbose) {
  hasIPv6 = false;
  currentIPv6 = "";
  currentIPv6Type = "NONE";

  esp_netif_t* staNetif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
  if (staNetif == nullptr) {
    if (verbose) {
      Serial.println("[WiFi] IPv6 查询失败: STA netif 不存在");
    }
    return;
  }

  esp_ip6_addr_t ip6List[5] = {};
  int count = esp_netif_get_all_ip6(staNetif, ip6List);
  if (count <= 0) {
    if (verbose) {
      Serial.println("[WiFi] 当前没有可用 IPv6 地址");
    }
    return;
  }

  int bestScore = -1;
  for (int i = 0; i < count; i++) {
    IPv6Address ip6(ip6List[i].addr);
    String addr = ip6.toString();
    if (addr.length() == 0 || addr == "::") {
      continue;
    }

    const char* type = classifyIPv6Type(ip6List[i]);
    if (verbose) {
      Serial.printf("[WiFi] IPv6[%d]=%s, type=%s\n", i, addr.c_str(), type);
    }

    int score = ipv6TypeScore(type);
    if (score > bestScore) {
      bestScore = score;
      currentIPv6 = addr;
      currentIPv6Type = String(type);
    }
  }

  hasIPv6 = bestScore >= 0;
  if (verbose && hasIPv6) {
    Serial.printf("[WiFi] IPv6 已选择: %s (%s)\n", currentIPv6.c_str(), currentIPv6Type.c_str());
    if (currentIPv6Type == "LINK_LOCAL") {
      Serial.println("[WiFi] 提示: LINK_LOCAL 不能直接公网访问");
    }
  }
}

void connectWiFi() {
  if (WiFi.status() == WL_CONNECTED) return;

  Serial.printf("[WiFi] 正在连接 %s\n", ssid);
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin(ssid, password);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 20) {
    delay(500);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] 连接成功，IP=%s\n", WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n[WiFi] 连接失败，请检查 SSID/密码");
  }
}

void doPortalAuth() {
  if (!enablePortalAuth || WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;

  String staIp = WiFi.localIP().toString();
  String staMac = WiFi.macAddress();
  String apMac = WiFi.BSSIDstr();
  staMac.toLowerCase();
  apMac.toLowerCase();

  String authUrl = String(portalAuthBaseUrl);
  authUrl += "?btn_onekey=true";
  authUrl += "&authtype=2";
  authUrl += "&pagetype=2";
  authUrl += "&vlan=4095";
  authUrl += "&staMac=" + staMac;
  authUrl += "&staIp=" + staIp;
  authUrl += "&apMac=" + apMac;
  authUrl += "&apIp=" + staIp;
  authUrl += "&supportTPAuth=true";

  Serial.println("[Portal] 请求地址: " + authUrl);

  http.begin(authUrl);
  int httpCode = http.GET();

  if (httpCode > 0) {
    Serial.printf("[Portal] HTTP 状态码: %d\n", httpCode);
    if (httpCode == 200) {
      Serial.println("[Portal] 认证完成");
    }
  } else {
    Serial.printf("[Portal] 认证失败: %s\n", HTTPClient::errorToString(httpCode).c_str());
  }

  http.end();
}

void testInternet() {
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  const char* testUrl = "http://captive.apple.com/hotspot-detect.html";
  const char* headerKeys[] = {"Location"};

  Serial.println("[NET] 正在检测外网连通性");
  http.collectHeaders(headerKeys, 1);
  http.begin(testUrl);
  int code = http.GET();

  if (code < 0) {
    Serial.printf("[NET] 请求失败: %s\n", HTTPClient::errorToString(code).c_str());
  } else if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    payload.toLowerCase();
    if (payload.indexOf("success") >= 0) {
      Serial.println("[NET] 外网可用");
    } else {
      Serial.println("[NET] 收到 200，但内容异常");
    }
  } else if (code == HTTP_CODE_NO_CONTENT) {
    Serial.println("[NET] 收到 204，外网大概率可用");
  } else if (code == HTTP_CODE_MOVED_PERMANENTLY ||
             code == HTTP_CODE_FOUND ||
             code == HTTP_CODE_TEMPORARY_REDIRECT ||
             code == HTTP_CODE_PERMANENT_REDIRECT) {
    Serial.printf("[NET] 发生重定向（%d），location=%s\n", code, http.header("Location").c_str());
  } else {
    Serial.printf("[NET] 异常 HTTP 状态码: %d\n", code);
  }

  http.end();
}

void connectMQTT() {
  if (mqttClient.connected() || WiFi.status() != WL_CONNECTED) return;

