1033087886/esp32-cam/src/main.cpp
  String clientId = String("esp32cam-") + WiFi.macAddress();
  clientId.replace(":", "");

  Serial.printf("[MQTT] 正在连接 %s:%u, clientId=%s\n", mqttHost, mqttPort, clientId.c_str());

  bool ok = false;
  if (strlen(mqttUsername) > 0) {
    ok = mqttClient.connect(
      clientId.c_str(),
      mqttUsername,
      mqttPassword,
      topicStateOnline.c_str(),
      1,
      true,
      "offline"
    );
  } else {
    ok = mqttClient.connect(
      clientId.c_str(),
      topicStateOnline.c_str(),
      1,
      true,
      "offline"
    );
  }

  if (!ok) {
    Serial.printf("[MQTT] 连接失败, state=%d\n", mqttClient.state());
    return;
  }

  mqttClient.subscribe(topicCmdLight.c_str(), 1);
  mqttClient.publish(topicStateOnline.c_str(), "online", true);
  publishLightState();
  publishHeartbeat();
  publishAck("connected");
  lastHeartbeatTime = millis();
  Serial.println("[MQTT] 连接成功并完成订阅");
}

String extractJsonValue(const String& json, const String& key) {
  String pattern = "\"" + key + "\"";
  int keyPos = json.indexOf(pattern);
  if (keyPos < 0) return "";

  int colonPos = json.indexOf(':', keyPos + pattern.length());
  if (colonPos < 0) return "";

  int start = colonPos + 1;
  while (start < (int)json.length() && isspace((unsigned char)json[start])) {
    start++;
  }
  if (start >= (int)json.length()) return "";

  if (json[start] == '"') {
    int endQuote = json.indexOf('"', start + 1);
    if (endQuote < 0) return "";
    return json.substring(start + 1, endQuote);
  }

  int end = start;
  while (end < (int)json.length() &&
         json[end] != ',' &&
         json[end] != '}' &&
         !isspace((unsigned char)json[end])) {
    end++;
  }
  return json.substring(start, end);
}

String decodeCommandPayload(byte* payload, unsigned int length) {
  String raw;
  raw.reserve(length + 1);
  for (unsigned int i = 0; i < length; i++) {
    raw += static_cast<char>(payload[i]);
  }
  raw.trim();

  if (!raw.startsWith("{")) {
    return raw;
  }

  String v = extractJsonValue(raw, "light");
  if (v.length() > 0) return v;

  v = extractJsonValue(raw, "msg");
  if (v.length() > 0) return v;

  return raw;
}

bool parseBrightnessCommand(String cmd, uint8_t& outValue) {
  cmd.trim();
  cmd.toLowerCase();

  if (cmd == "on" || cmd == "led/on" || cmd == "1") {
    outValue = 255;
    return true;
  }

  if (cmd == "off" || cmd == "led/off" || cmd == "0") {
    outValue = 0;
    return true;
  }

  char* endPtr = nullptr;
  long value = strtol(cmd.c_str(), &endPtr, 10);
  if (*endPtr != '\0') {
    return false;
  }

  if (value < 0) value = 0;
  if (value > 255) value = 255;
  outValue = static_cast<uint8_t>(value);
  return true;
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String cmd = decodeCommandPayload(payload, length);
  String cmdLower = cmd;
  cmdLower.toLowerCase();

  Serial.printf("[MQTT] 收到消息 topic=%s payload=%s\n", topic, cmd.c_str());

  if (strcmp(topic, topicCmdLight.c_str()) != 0) {
    return;
  }

  if (cmdLower == "ping") {
    publishAck("pong");
    return;
  }

  if (cmdLower == "auth") {
    doPortalAuth();
    publishAck("portal-auth-done");
    return;
  }

  if (cmdLower == "status" || cmdLower == "light/status") {
    publishLightState();
    publishAck("light-status");
    return;
  }

  if (cmdLower == "toggle" || cmdLower == "light/toggle") {
    setFlashBrightness(currentLight > 0 ? 0 : 255, true);
    publishAck("light-toggle");
    return;
  }

  uint8_t nextValue = 0;
  if (parseBrightnessCommand(cmd, nextValue)) {
    setFlashBrightness(nextValue, true);
    publishAck("light-updated");
  } else {
    publishAck("unknown-cmd");
    Serial.println("[MQTT] 无效亮度命令，请用 0-255/on/off/toggle");
  }
}

const char* cameraSensorProfileToString(CameraSensorProfile profile) {
  switch (profile) {
    case CameraSensorProfile::OV2640: return "OV2640";
    case CameraSensorProfile::OV3660: return "OV3660";
    case CameraSensorProfile::GC2145: return "GC2145";
    default: return "UNKNOWN";
  }
}

CameraSensorProfile cameraSensorProfileFromPid(uint16_t pid) {
  if (pid == OV2640_PID) return CameraSensorProfile::OV2640;
  if (pid == OV3660_PID) return CameraSensorProfile::OV3660;
  if (pid == GC2145_PID) return CameraSensorProfile::GC2145;
  return CameraSensorProfile::UNKNOWN;
}

CameraSensorProfile parseForcedSensorProfile(
  const char* raw,
  bool* forceEnabled,
  bool* valueValid,
  char* normalized,
  size_t normalizedSize
) {
  if (forceEnabled != nullptr) *forceEnabled = false;
  if (valueValid != nullptr) *valueValid = false;
  if (normalized != nullptr && normalizedSize > 0) {
    normalized[0] = '\0';
  }

  const char* source = (raw != nullptr) ? raw : "";
  char token[24] = {0};
  size_t writePos = 0;

  for (size_t i = 0; source[i] != '\0' && writePos < sizeof(token) - 1; i++) {
    const unsigned char ch = static_cast<unsigned char>(source[i]);
    if (isspace(ch) || ch == '"' || ch == '\'' || ch == '-' || ch == '_') {
      continue;
    }
    token[writePos++] = static_cast<char>(tolower(ch));
  }
  token[writePos] = '\0';

  if (writePos == 0) {
    strcpy(token, "auto");
    writePos = strlen(token);
  }

  if (normalized != nullptr && normalizedSize > 0) {
    const size_t copyLen = (writePos < normalizedSize - 1) ? writePos : (normalizedSize - 1);
    memcpy(normalized, token, copyLen);
    normalized[copyLen] = '\0';
  }

  if (strcmp(token, "auto") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = false;
    return CameraSensorProfile::UNKNOWN;
  }
  if (strcmp(token, "ov2640") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = true;
    return CameraSensorProfile::OV2640;
  }
  if (strcmp(token, "ov3660") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = true;
    return CameraSensorProfile::OV3660;
  }
  if (strcmp(token, "gc2145") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = true;
    return CameraSensorProfile::GC2145;
  }

  return CameraSensorProfile::UNKNOWN;
}

const char* pixformatToString(pixformat_t pixformat) {
  if (pixformat == PIXFORMAT_JPEG) return "JPEG";
  return "NON_JPEG";
}

const char* frameSizeToString(framesize_t frameSize) {
  if (frameSize == FRAMESIZE_QVGA) return "QVGA";
  if (frameSize == FRAMESIZE_VGA) return "VGA";
  return "OTHER";
}

template <typename T>
bool applySensorSetting(sensor_t* sensor, const char* settingName, T value, int (*setter)(sensor_t*, T)) {
  if (sensor == nullptr || setter == nullptr) {
    Serial.printf("[CAM] 参数设置失败: %s=%d, setter 不可用\n", settingName, static_cast<int>(value));
    return false;
  }

  const int rc = setter(sensor, value);
  if (rc != 0) {
    Serial.printf("[CAM] 参数设置失败: %s=%d, rc=%d\n", settingName, static_cast<int>(value), rc);
    return false;
  }
  return true;
}

