1033087886/esp32-cam/src/main.cpp
bool initCamera() {
  const char* forceRaw = CAM_STRINGIFY(CAM_FORCE_SENSOR);
  char forceNormalized[16] = {0};
  bool forceEnabled = false;
  bool forceValid = false;
  const CameraSensorProfile forcedProfile = parseForcedSensorProfile(
    forceRaw,
    &forceEnabled,
    &forceValid,
    forceNormalized,
    sizeof(forceNormalized)
  );
  if (!forceValid) {
    Serial.printf(
      "[CAM] CAM_FORCE_SENSOR 配置无效: raw=%s, 仅支持 auto/ov2640/ov3660/gc2145，已回退 auto\n",
      forceRaw
    );
  }
  Serial.printf(
    "[CAM] CAM_FORCE_SENSOR raw=%s parsed=%s enabled=%s\n",
    forceRaw,
    forceNormalized,
    forceEnabled ? "yes" : "no"
  );
  Serial.printf(
    "[CAM] 依赖检查: gc2145 header hint=%s\n",
    HAS_GC2145_DRIVER_HEADER_HINT ? "found" : "not-found"
  );

  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;

  const bool hasPsram = psramFound();
  framesize_t targetFrameSize = hasPsram ? streamFrameSizePsram : streamFrameSizeNoPsram;
  if (forceEnabled &&
      forcedProfile == CameraSensorProfile::GC2145 &&
      targetFrameSize != FRAMESIZE_QVGA &&
      targetFrameSize != FRAMESIZE_VGA) {
    targetFrameSize = hasPsram ? FRAMESIZE_VGA : FRAMESIZE_QVGA;
    Serial.printf("[CAM] GC2145 模式已调整分辨率到 %s\n", frameSizeToString(targetFrameSize));
  }

  if (hasPsram) {
    config.frame_size = targetFrameSize;
    config.jpeg_quality = streamJpegQualityPsram;
    config.fb_count = 3;
  } else {
    config.frame_size = targetFrameSize;
    config.jpeg_quality = streamJpegQualityNoPsram;
    config.fb_count = 1;
  }

#if defined(CAMERA_GRAB_LATEST)
  config.grab_mode = CAMERA_GRAB_LATEST;
#endif
#if defined(CAMERA_FB_IN_PSRAM)
  config.fb_location = CAMERA_FB_IN_PSRAM;
#endif

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("[CAM] 初始化失败: 0x%x\n", err);
    return false;
  }

  currentJpegQuality = static_cast<uint8_t>(config.jpeg_quality);
  sensor_t* sensor = esp_camera_sensor_get();
  uint16_t detectedPid = 0;
  CameraSensorProfile detectedProfile = CameraSensorProfile::UNKNOWN;
  if (sensor != nullptr) {
    detectedPid = sensor->id.PID;
    detectedProfile = cameraSensorProfileFromPid(detectedPid);
  }
  CameraSensorProfile activeProfile = forceEnabled ? forcedProfile : detectedProfile;

  Serial.printf(
    "[CAM] 探测 PID=0x%04X, detected=%s\n",
    detectedPid,
    cameraSensorProfileToString(detectedProfile)
  );
  if (forceEnabled) {
    Serial.printf(
      "[CAM] 强制传感器已启用: %s\n",
      cameraSensorProfileToString(forcedProfile)
    );
    if (forcedProfile != detectedProfile) {
      Serial.printf(
        "[CAM] 强制覆盖探测结果: %s -> %s\n",
        cameraSensorProfileToString(detectedProfile),
        cameraSensorProfileToString(forcedProfile)
      );
    }
  }
  Serial.printf("[CAM] 传感器决策 final=%s\n", cameraSensorProfileToString(activeProfile));

  bool settingOk = true;
  if (sensor != nullptr) {
    settingOk &= applySensorSetting(
      sensor,
      "set_pixformat",
      config.pixel_format,
      sensor->set_pixformat
    );
    settingOk &= applySensorSetting(
      sensor,
      "set_framesize",
      config.frame_size,
      sensor->set_framesize
    );
    settingOk &= applySensorSetting(
      sensor,
      "set_quality",
      static_cast<int>(currentJpegQuality),
      sensor->set_quality
    );

    settingOk &= applySensorSetting(sensor, "set_contrast", 2, sensor->set_contrast);
    settingOk &= applySensorSetting(sensor, "set_sharpness", 2, sensor->set_sharpness);
    settingOk &= applySensorSetting(sensor, "set_denoise", 0, sensor->set_denoise);
    settingOk &= applySensorSetting(sensor, "set_gainceiling", GAINCEILING_8X, sensor->set_gainceiling);
    settingOk &= applySensorSetting(sensor, "set_aec2", 1, sensor->set_aec2);
    settingOk &= applySensorSetting(sensor, "set_dcw", 0, sensor->set_dcw);
    settingOk &= applySensorSetting(sensor, "set_lenc", 1, sensor->set_lenc);
    settingOk &= applySensorSetting(sensor, "set_brightness", 0, sensor->set_brightness);
    settingOk &= applySensorSetting(sensor, "set_saturation", 0, sensor->set_saturation);

    if (activeProfile == CameraSensorProfile::OV3660) {
      settingOk &= applySensorSetting(sensor, "set_vflip", 1, sensor->set_vflip);
      settingOk &= applySensorSetting(sensor, "set_hmirror", 0, sensor->set_hmirror);
      settingOk &= applySensorSetting(sensor, "set_brightness", 1, sensor->set_brightness);
      settingOk &= applySensorSetting(sensor, "set_saturation", -1, sensor->set_saturation);
      Serial.println("[CAM] 已应用 OV3660 保守调优");
    } else if (activeProfile == CameraSensorProfile::GC2145) {
      settingOk &= applySensorSetting(sensor, "set_vflip", 0, sensor->set_vflip);
      settingOk &= applySensorSetting(sensor, "set_hmirror", 0, sensor->set_hmirror);
      settingOk &= applySensorSetting(sensor, "set_gainceiling", GAINCEILING_4X, sensor->set_gainceiling);
      settingOk &= applySensorSetting(sensor, "set_dcw", 1, sensor->set_dcw);
      settingOk &= applySensorSetting(sensor, "set_contrast", 1, sensor->set_contrast);
      settingOk &= applySensorSetting(sensor, "set_sharpness", 1, sensor->set_sharpness);
      settingOk &= applySensorSetting(sensor, "set_denoise", 1, sensor->set_denoise);
      settingOk &= applySensorSetting(sensor, "set_brightness", 0, sensor->set_brightness);
      settingOk &= applySensorSetting(sensor, "set_saturation", 0, sensor->set_saturation);
      Serial.println(
        "[CAM] 已应用 GC2145 稳定参数: JPEG + QVGA/VGA + gainceiling=4x + dcw=1"
      );
    }
  } else {
    settingOk = false;
    Serial.println("[CAM] 警告: 未获取到 sensor 句柄，无法应用参数");
  }

  Serial.printf(
    "[CAM] 最终配置 pixformat=%s(%d), framesize=%s(%d), jpeg_quality=%d, fb_count=%d\n",
    pixformatToString(config.pixel_format),
    static_cast<int>(config.pixel_format),
    frameSizeToString(config.frame_size),
    static_cast<int>(config.frame_size),
    config.jpeg_quality,
    config.fb_count
  );
  if (!settingOk) {
    Serial.println("[CAM] 警告: 部分参数设置失败，已继续运行");
  }
  return true;
}

void connectStreamWs() {
  if (wsClient.available() || WiFi.status() != WL_CONNECTED) return;

  wsReconnectCount++;
  Serial.println("[WS] 正在连接推流端点: " + String(streamWsUrl));
  Serial.printf("[WS] 重连次数: %lu\n", wsReconnectCount);
  Serial.printf("[WS] 连接前可用堆内存: %u\n", ESP.getFreeHeap());

  if (!wsClient.connect(streamWsHost, streamWsPort, streamWsPath)) {
    wsConnected = false;
    Serial.println("[WS] 连接失败");
    Serial.printf("[WS] 连接失败后可用堆内存: %u\n", ESP.getFreeHeap());
  }
}

void sendStreamFrameIfReady() {
  if (!wsClient.available() || !wsConnected) return;

  unsigned long now = millis();
  if (now - lastFrameTime < streamInterval) return;
  if (now - wsConnectedAt < streamSendWarmupMs) return;
  if (lastStreamStatTime == 0) {
    lastStreamStatTime = now;
  }

  unsigned long captureStart = millis();
  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("[CAM] 抓帧失败");
    return;
  }
  unsigned long captureMs = millis() - captureStart;
  size_t frameBytes = fb->len;

